#### Terraform Format 🖌 `success`
#### TFLint 🔍 `success`
#### Checkov Security 🛡️ `success`
#### Terraform Init ⚙️ `success`
#### Terraform Validate 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
cloudflare_zone_setting.com_always_use_https: Refreshing state... [id=always_use_https]
cloudflare_zone_setting.io_tls_1_3: Refreshing state... [id=tls_1_3]
cloudflare_zone_setting.com_ssl: Refreshing state... [id=ssl]
cloudflare_dns_record.com_dmarc: Refreshing state... [id=dd425603cec0e19b1976bdbf6130cf51]
cloudflare_zone_setting.com_brotli: Refreshing state... [id=brotli]
cloudflare_zone_setting.io_brotli: Refreshing state... [id=brotli]
data.cloudflare_zone.com: Reading...
cloudflare_dns_record.io_dmarc: Refreshing state... [id=51d5dee04eb35f5ddceb4b1da32e93fa]
cloudflare_zone_setting.com_security_level: Refreshing state... [id=security_level]
cloudflare_zone_setting.com_automatic_https_rewrites: Refreshing state... [id=automatic_https_rewrites]
cloudflare_zone_setting.io_always_use_https: Refreshing state... [id=always_use_https]
cloudflare_zone_setting.com_tls_1_3: Refreshing state... [id=tls_1_3]
cloudflare_email_routing_settings.com: Refreshing state... [id=079a66a49aa90bf9799e6283d9c6e60c]
data.cloudflare_zone.io: Reading...
cloudflare_zone_setting.io_ssl: Refreshing state... [id=ssl]
cloudflare_email_routing_settings.io: Refreshing state... [id=423c6a332e5079f6a5d32a24dc98291e]
cloudflare_zone_setting.com_min_tls_version: Refreshing state... [id=min_tls_version]
cloudflare_email_routing_address.primary: Refreshing state... [id=30bd518646e848dc9ff23bf90d92b83c]
cloudflare_zone_setting.io_min_tls_version: Refreshing state... [id=min_tls_version]
data.cloudflare_zone.io: Read complete after 1s [id=423c6a332e5079f6a5d32a24dc98291e]
cloudflare_zone_setting.io_security_level: Refreshing state... [id=security_level]
cloudflare_zone_setting.io_automatic_https_rewrites: Refreshing state... [id=automatic_https_rewrites]
data.github_organization.signalstratum: Reading...
module.repo_infrastructure.github_repository.this: Refreshing state... [id=infrastructure]
data.cloudflare_zone.com: Read complete after 1s [id=079a66a49aa90bf9799e6283d9c6e60c]
data.github_user.current: Reading...
cloudflare_email_routing_dns.com: Refreshing state... [id=079a66a49aa90bf9799e6283d9c6e60c]
cloudflare_email_routing_dns.io: Refreshing state... [id=423c6a332e5079f6a5d32a24dc98291e]
cloudflare_email_routing_catch_all.com: Refreshing state... [id=079a66a49aa90bf9799e6283d9c6e60c]
cloudflare_email_routing_catch_all.io: Refreshing state... [id=423c6a332e5079f6a5d32a24dc98291e]
data.github_organization.signalstratum: Read complete after 1s [id=251301321]
data.github_user.current: Read complete after 2s [id=128909040]
module.repo_infrastructure.github_branch_protection.main[0]: Refreshing state... [id=BPR_kwDOQuOit84EPOn_]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.cloudflare_zero_trust_tunnel_cloudflared_token.virginia_talos will be read during apply
  # (config refers to values not yet known)
 <= data "cloudflare_zero_trust_tunnel_cloudflared_token" "virginia_talos" {
      + account_id = "c574042714913ce519ad59f95e0ff053"
      + token      = (known after apply)
      + tunnel_id  = (known after apply)
    }

  # cloudflare_dns_record.com_kube will be created
  + resource "cloudflare_dns_record" "com_kube" {
      + comment             = "Virginia Talos cluster API - private IP via WARP"
      + comment_modified_on = (known after apply)
      + content             = "10.0.1.100"
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "kube"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 300
      + type                = "A"
      + zone_id             = "079a66a49aa90bf9799e6283d9c6e60c"
    }

  # cloudflare_dns_record.io_kube will be created
  + resource "cloudflare_dns_record" "io_kube" {
      + comment             = "Alias to .com for Virginia Talos cluster"
      + comment_modified_on = (known after apply)
      + content             = "kube.signalstratum.com"
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "kube"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 300
      + type                = "CNAME"
      + zone_id             = "423c6a332e5079f6a5d32a24dc98291e"
    }

  # cloudflare_zero_trust_tunnel_cloudflared.virginia_talos will be created
  + resource "cloudflare_zero_trust_tunnel_cloudflared" "virginia_talos" {
      + account_id        = "c574042714913ce519ad59f95e0ff053"
      + account_tag       = (known after apply)
      + config_src        = "local"
      + connections       = (known after apply)
      + conns_active_at   = (known after apply)
      + conns_inactive_at = (known after apply)
      + created_at        = (known after apply)
      + deleted_at        = (known after apply)
      + id                = (known after apply)
      + metadata          = (known after apply)
      + name              = "virginia-talos"
      + remote_config     = (known after apply)
      + status            = (known after apply)
      + tun_type          = (known after apply)
    }

  # cloudflare_zero_trust_tunnel_cloudflared_config.virginia_talos will be created
  + resource "cloudflare_zero_trust_tunnel_cloudflared_config" "virginia_talos" {
      + account_id = "c574042714913ce519ad59f95e0ff053"
      + config     = {
          + ingress = [
              + {
                  + service = "http_status:404"
                },
            ]
        }
      + created_at = (known after apply)
      + id         = (known after apply)
      + source     = (known after apply)
      + tunnel_id  = (known after apply)
      + version    = (known after apply)
    }

  # cloudflare_zero_trust_tunnel_cloudflared_route.virginia_private_network will be created
  + resource "cloudflare_zero_trust_tunnel_cloudflared_route" "virginia_private_network" {
      + account_id         = "c574042714913ce519ad59f95e0ff053"
      + comment            = "Hetzner Cloud private network - Virginia Talos cluster"
      + created_at         = (known after apply)
      + deleted_at         = (known after apply)
      + id                 = (known after apply)
      + network            = "10.0.0.0/16"
      + tunnel_id          = (known after apply)
      + virtual_network_id = (known after apply)
    }

  # github_actions_organization_permissions.this will be created
  + resource "github_actions_organization_permissions" "this" {
      + allowed_actions      = "selected"
      + enabled_repositories = "all"
      + id                   = (known after apply)

      + allowed_actions_config {
          + github_owned_allowed = true
          + patterns_allowed     = [
              + "1password/*",
              + "cloudflare/*",
              + "hashicorp/*",
            ]
        }
    }

  # module.onepassword_virginia_tunnel[0].onepassword_item.this will be created
  + resource "onepassword_item" "this" {
      + category   = "password"
      + id         = (known after apply)
      + note_value = (sensitive value)
      + password   = (sensitive value)
      + tags       = [
          + "terraform",
          + "cloudflare",
          + "virginia-talos",
          + "tunnel",
        ]
      + title      = "Cloudflare Tunnel - Virginia Talos"
      + url        = "https://one.dash.cloudflare.com/"
      + uuid       = (known after apply)
      + vault      = "ss-tf-managed"

      + section {
          + id    = (known after apply)
          + label = (sensitive value)

          + field {
              + id    = (known after apply)
              + label = (sensitive value)
              + type  = (sensitive value)
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = (sensitive value)
              + type  = (sensitive value)
              + value = (sensitive value)
            }
        }
    }

  # module.repo_infrastructure.github_branch_protection.main[0] will be updated in-place
  ~ resource "github_branch_protection" "main" {
        id                              = "BPR_kwDOQuOit84EPOn_"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              - "/JaredMichaelHawkins",
              + "U_kgDOB67-8A",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              - "/JaredMichaelHawkins",
              + "U_kgDOB67-8A",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repo_infrastructure.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
      + archive_on_destroy          = true
        id                          = "infrastructure"
        name                        = "infrastructure"
      ~ topics                      = [
          + "cloudflare",
          + "github",
          + "infrastructure-as-code",
          + "terraform",
        ]
        # (38 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repo_talos_clusters.github_branch_protection.main[0] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "U_kgDOB67-8A",
            ]
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 0
        }

      + required_status_checks {
          + contexts = [
              + "Terraform",
            ]
          + strict   = true
        }

      + restrict_pushes {
          + blocks_creations = true
          + push_allowances  = [
              + "U_kgDOB67-8A",
            ]
        }
    }

  # module.repo_talos_clusters.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Talos Kubernetes clusters on Hetzner Cloud with Cloudflare zero-trust access"
      + etag                        = (known after apply)
      + fork                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "talos-clusters"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + source_owner                = (known after apply)
      + source_repo                 = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "hetzner-cloud",
          + "kubernetes",
          + "talos",
          + "terraform",
        ]
      + visibility                  = "private"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

Plan: 9 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ email_routing           = {
      ~ domains     = {
          - com = {
              - enabled = true
              - name    = "signalstratum.com"
            }
          - io  = {
              - enabled = true
              - name    = "signalstratum.io"
            }
        } -> [
          + "signalstratum.com",
          + "signalstratum.io",
        ]
      - note        = "Verify signalstratum@gmail.com via email link from Cloudflare"
        # (1 unchanged attribute hidden)
    }
  ~ github_connectivity     = {
      ~ organization     = {
          - description = ""
          - name        = ""
          - plan        = "free"
        } -> ""
        # (2 unchanged attributes hidden)
    }
  - github_repository       = {
      - branch_protection = "main (signed commits required)"
      - name              = "infrastructure"
      - url               = "https://github.com/signalstratum/infrastructure"
      - visibility        = "public"
    } -> null
  ~ repositories            = {
      ~ talos_clusters = {
          + full_name     = (known after apply)
          ~ name          = null -> "talos-clusters"
          + node_id       = (known after apply)
          + ssh_clone_url = (known after apply)
          + url           = (known after apply)
          ~ visibility    = null -> "private"
        }
        # (1 unchanged attribute hidden)
    }
  ~ security_settings       = {
      - compression    = "brotli"
      - https          = {
          - always_use_https   = "enabled"
          - automatic_rewrites = "enabled"
        }
      + min_tls        = "1.2"
      - tls            = {
          - min_version = "1.2"
          - mode        = "strict"
          - tls_1_3     = "enabled"
        }
      + tls_mode       = "strict"
        # (1 unchanged attribute hidden)
    }
  + virginia_tunnel_id      = (known after apply)
  + virginia_tunnel_token   = (sensitive value)

Warning: Resource Destruction Considerations

  with cloudflare_zero_trust_tunnel_cloudflared_config.virginia_talos,
  on cloudflare.tf line 36, in resource "cloudflare_zero_trust_tunnel_cloudflared_config" "virginia_talos":
  36: resource "cloudflare_zero_trust_tunnel_cloudflared_config" "virginia_talos" {

This resource cannot be destroyed from Terraform. If you create this
resource, it will be present in the API until manually deleted.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @JaredMichaelHawkins, Action: `pull_request`*